
cask_args appdir: "/Applications"

tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "AdoptOpenJDK/openjdk"

brew "bat"
brew "diff-so-fancy"
brew "fd"
brew "git"
brew "gpg"
brew "httpie"
brew "iftop"
brew "mas"
brew "mtr"
brew "noti"
brew "nvm"
brew "pinentry-mac"
brew "prettyping"
brew "python"
brew "rbenv"
brew "rbenv-bundler"
brew "rbenv-bundler-ruby-version"
brew "ruby-build"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"

cask "1password"
cask "aerial"
cask "alfred"
cask "banktivity"
cask "battle-net"
cask "calibre"
cask "daisydisk"
cask "discord"
cask "docker"
cask "doxie"
cask "firefox"
cask "fly"
cask "google-chrome"
cask "intellij-idea"
cask "iterm2"
cask "adoptopenjdk/openjdk/adoptopenjdk8"
cask "adoptopenjdk/openjdk/adoptopenjdk11"
cask "adoptopenjdk/openjdk/adoptopenjdk16"
cask "little-snitch"
cask "mailtrackerblocker"
cask "moom"
cask "omnigraffle"
cask "scroll-reverser"
cask "signal"
cask "slack"
cask "steam"
cask "transmit"
cask "vanilla"
cask "visual-studio-code"

mas "Kindle", id: 405399194
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Pixelmator Pro", id: 1289583905
mas "Things3", id: 904280696
mas "Tweetbot 3", id: 1384080005
mas "Kaleidoscope", id: 587512244
mas "Reeder 5", id: 1529448980
