
cask_args appdir: "/Applications"

tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "AdoptOpenJDK/openjdk"

brew "bat"
brew "diff-so-fancy"
brew "fd"
brew "git"
brew "httpie"
brew "iftop"
brew "mas"
brew "mosh"
brew "mtr"
brew "noti"
brew "prettyping"
brew "python"
brew "rbenv"
brew "rbenv-bundler"
brew "rbenv-bundler-ruby-version"
brew "ruby-build"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "vim"

cask "1password"
cask "alfred"
cask "banktivity"
cask "battle-net"
cask "calibre"
cask "daisydisk"
cask "docker"
cask "doxie"
cask "dropbox"
cask "firefox"
cask "google-chrome"
cask "intellij-idea"
cask "iterm2"
cask "java8"
cask "adoptopenjdk11"
cask "kaleidoscope"
cask "little-snitch"
cask "moom"
cask "omnigraffle"
cask "scroll-reverser"
cask "slack"
cask "steam"
cask "visual-studio-code"

mas "Kindle", id: 405399194
mas "Monity", id: 915542151
mas "Paprika Recipe Manager", id: 451907568
mas "Pixelmator Pro", id: 1289583905
mas "Things3", id: 904280696
mas "Tweetbot", id: 557168941
